{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<BOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<EOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<MASK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "(a♭)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "(a)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "(a#)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "(b♭)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "(b)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "(c)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 11,
      "content": "(c#)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 12,
      "content": "(d)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 13,
      "content": "(d#)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "(e♭)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 15,
      "content": "(e)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 16,
      "content": "(f)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 17,
      "content": "(f#)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 18,
      "content": "(g)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 19,
      "content": "(g#)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 20,
      "content": "(A♭)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 21,
      "content": "(A)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 22,
      "content": "(B♭)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 23,
      "content": "(B)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 24,
      "content": "(C♭)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 25,
      "content": "(C)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 26,
      "content": "(C#)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 27,
      "content": "(D♭)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 28,
      "content": "(D)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 29,
      "content": "(E♭)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 30,
      "content": "(E)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 31,
      "content": "(F)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 32,
      "content": "(F#)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 33,
      "content": "(G)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 34,
      "content": "(G#)",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<BOS>": {
        "id": "<BOS>",
        "ids": [
          1
        ],
        "tokens": [
          "<BOS>"
        ]
      },
      "<EOS>": {
        "id": "<EOS>",
        "ids": [
          2
        ],
        "tokens": [
          "<EOS>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<UNK>",
    "continuing_subword_prefix": "**",
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<UNK>": 0,
      "<BOS>": 1,
      "<EOS>": 2,
      "<PAD>": 3,
      "<MASK>": 4,
      "(a♭)": 5,
      "(a)": 6,
      "(a#)": 7,
      "(b♭)": 8,
      "(b)": 9,
      "(c)": 10,
      "(c#)": 11,
      "(d)": 12,
      "(d#)": 13,
      "(e♭)": 14,
      "(e)": 15,
      "(f)": 16,
      "(f#)": 17,
      "(g)": 18,
      "(g#)": 19,
      "(A♭)": 20,
      "(A)": 21,
      "(B♭)": 22,
      "(B)": 23,
      "(C♭)": 24,
      "(C)": 25,
      "(C#)": 26,
      "(D♭)": 27,
      "(D)": 28,
      "(E♭)": 29,
      "(E)": 30,
      "(F)": 31,
      "(F#)": 32,
      "(G)": 33,
      "(G#)": 34,
      "#": 35,
      "(": 36,
      ")": 37,
      "+": 38,
      "/": 39,
      "0": 40,
      "1": 41,
      "2": 42,
      "3": 43,
      "4": 44,
      "5": 45,
      "6": 46,
      "7": 47,
      "8": 48,
      "9": 49,
      "=": 50,
      "A": 51,
      "B": 52,
      "C": 53,
      "D": 54,
      "E": 55,
      "F": 56,
      "G": 57,
      "I": 58,
      "V": 59,
      "[": 60,
      "]": 61,
      "a": 62,
      "b": 63,
      "c": 64,
      "d": 65,
      "e": 66,
      "f": 67,
      "g": 68,
      "i": 69,
      "r": 70,
      "s": 71,
      "t": 72,
      "u": 73,
      "v": 74,
      "°": 75,
      "ø": 76,
      "♭": 77,
      "**i": 78,
      "**6": 79,
      "**5": 80,
      "**s": 81,
      "**u": 82,
      "**4": 83,
      "**3": 84,
      "**I": 85,
      "**7": 86,
      "**V": 87,
      "**9": 88,
      "**v": 89,
      "**2": 90,
      "**8": 91,
      "**(": 92,
      "**0": 93,
      "**r": 94,
      "**e": 95,
      "**t": 96,
      "**)": 97,
      "**ø": 98,
      "**[": 99,
      "**#": 100,
      "**1": 101,
      "**♭": 102,
      "**/": 103,
      "vi": 104,
      "ii": 105,
      "V6": 106,
      "IV": 107,
      "vii": 108,
      "V7": 109,
      "**II": 110,
      "I6": 111,
      "III": 112,
      "**us": 113,
      "**sus": 114,
      "iv": 115,
      "V65": 116,
      "**43": 117,
      "**42": 118,
      "V42": 119,
      "VI": 120,
      "**65": 121,
      "♭)": 122,
      "**sus43": 123,
      "IV6": 124,
      "i6": 125,
      "iii": 126,
      "iiø": 127,
      "VII": 128,
      "#)": 129,
      "iv6": 130,
      "V7sus43": 131,
      "viiø": 132,
      "iiø65": 133,
      "Vsus43": 134,
      ")[": 135,
      "**98": 136,
      "**sus98": 137,
      "**76": 138,
      "**sus76": 139,
      "ii65": 140,
      "III6": 141,
      "V43": 142,
      "ii6": 143,
      "I64": 144,
      "vi6": 145,
      "i64": 146,
      "ii7": 147,
      "viiø7": 148,
      "♭)[": 149,
      "V64": 150,
      "VI6": 151,
      "64": 152,
      "65": 153,
      "**23": 154,
      "IV7": 155,
      "iii6": 156,
      "°)": 157,
      "#)[": 158,
      "vi65": 159,
      "6sus76": 160,
      "**sus23": 161,
      "**sus4": 162,
      "iiø7": 163,
      "iv7": 164,
      "vi7": 165,
      "42": 166,
      "43": 167,
      "v6": 168,
      "vi42": 169,
      "iiø42": 170,
      "vi64": 171,
      "iv65": 172,
      "Isus98": 173,
      "iiø43": 174,
      "VII6": 175,
      "IV64": 176,
      "°/": 177,
      "I6sus76": 178,
      "Vsus98": 179,
      "V6sus23": 180,
      "Vsus4": 181,
      "viiø43": 182,
      "visus98": 183,
      "vii6": 184,
      "III64": 185,
      "iisus98": 186,
      "iii7": 187,
      "I7": 188,
      "viiø42": 189,
      "**re": 190,
      "iv6sus76": 191,
      "v64": 192,
      "**ret": 193,
      "isus98": 194,
      "ii42": 195,
      "IV43": 196,
      "IV65": 197,
      "viiø65": 198,
      "**([": 199,
      "ii43": 200,
      "iv64": 201,
      "IV9": 202,
      "iisus43": 203,
      "ii64": 204,
      "(#": 205,
      "+)": 206,
      "II": 207,
      "isus4": 208,
      "**56": 209,
      "III7": 210,
      "iv9": 211,
      "ivsus98": 212,
      "**ret56": 213,
      "IVsus98": 214,
      "65sus76": 215,
      "VI7": 216,
      "I9": 217,
      "V65sus76": 218,
      "/♭": 219,
      "V7sus98": 220,
      "V7sus23": 221,
      "V7sus4": 222,
      "iiisus43": 223,
      ")([": 224,
      "Isus43": 225,
      "V9": 226,
      "i7": 227,
      "**54": 228,
      "**21": 229,
      "viø": 230,
      "ii9": 231,
      "IIIsus98": 232,
      "**sus54": 233,
      "**sus21": 234,
      "iv43": 235,
      "VIret": 236,
      "VI64": 237,
      "**23sus43": 238,
      "VIret23sus43": 239,
      "I42": 240,
      "IV42": 241,
      "**sus65": 242,
      "VI42": 243,
      "IV6sus76": 244,
      "iii64": 245,
      "Iv": 246,
      "i42": 247,
      "V6sus76": 248,
      "♭)([": 249,
      "(♭": 250,
      "7sus23": 251,
      "v7": 252,
      "**IV": 253,
      "**vsus76": 254,
      "visus4": 255,
      "visus21": 256,
      "vivsus76": 257,
      "iisus4": 258,
      "iiIV": 259,
      "I65": 260,
      "ivsus76": 261,
      "V650": 262,
      "ii65sus76": 263,
      "V43sus76": 264,
      "I64ret56": 265,
      "iiIV65": 266,
      "ivsus76sus98": 267,
      "7sus43": 268,
      "Isus23": 269,
      "Isus4": 270,
      "Vsus23": 271,
      "])": 272,
      "i43": 273,
      "sus": 274,
      "vsus98": 275,
      "vi43": 276,
      "iisus23": 277,
      "IVsus43": 278,
      "III9": 279,
      "III42": 280,
      "IIIsus23": 281,
      "iv42": 282,
      "V65sus23": 283,
      "VIsus98": 284,
      "VIsus76": 285,
      "Vsus43sus65": 286,
      "ii6sus76": 287,
      "I64sus54": 288,
      "VI6sus76": 289,
      "VI6ret56": 290,
      "vii64": 291,
      "ii43sus54": 292,
      "II6": 293,
      "iiisus43sus23": 294,
      "viø7": 295,
      "viø65": 296,
      "sus43": 297,
      "IVsus43sus98": 298,
      "Isus21": 299,
      "Vsus65": 300,
      "IVret56": 301,
      "iii6sus23": 302,
      "Iv6": 303,
      "))": 304,
      "#)([": 305,
      ")(": 306
    },
    "merges": [
      "v **i",
      "i **i",
      "V **6",
      "I **V",
      "vi **i",
      "V **7",
      "**I **I",
      "I **6",
      "I **II",
      "**u **s",
      "**s **us",
      "i **v",
      "V6 **5",
      "**4 **3",
      "**4 **2",
      "V **42",
      "V **I",
      "**6 **5",
      "♭ **)",
      "**sus **43",
      "IV **6",
      "i **6",
      "ii **i",
      "ii **ø",
      "V **II",
      "# **)",
      "iv **6",
      "V7 **sus43",
      "vii **ø",
      "iiø **65",
      "V **sus43",
      ") **[",
      "**9 **8",
      "**sus **98",
      "**7 **6",
      "**sus **76",
      "ii **65",
      "III **6",
      "V **43",
      "ii **6",
      "I6 **4",
      "vi **6",
      "i6 **4",
      "ii **7",
      "viiø **7",
      "♭) **[",
      "V6 **4",
      "VI **6",
      "6 **4",
      "6 **5",
      "**2 **3",
      "IV **7",
      "iii **6",
      "° **)",
      "#) **[",
      "vi **65",
      "6 **sus76",
      "**sus **23",
      "**sus **4",
      "iiø **7",
      "iv **7",
      "vi **7",
      "4 **2",
      "4 **3",
      "v **6",
      "vi **42",
      "iiø **42",
      "vi6 **4",
      "iv **65",
      "I **sus98",
      "iiø **43",
      "VII **6",
      "IV6 **4",
      "° **/",
      "I6 **sus76",
      "V **sus98",
      "V6 **sus23",
      "V **sus4",
      "viiø **43",
      "vi **sus98",
      "vii **6",
      "III6 **4",
      "ii **sus98",
      "iii **7",
      "I **7",
      "viiø **42",
      "**r **e",
      "iv6 **sus76",
      "v6 **4",
      "**re **t",
      "i **sus98",
      "ii **42",
      "IV **43",
      "IV **65",
      "viiø **65",
      "**( **[",
      "ii **43",
      "iv6 **4",
      "IV **9",
      "ii **sus43",
      "ii6 **4",
      "( **#",
      "+ **)",
      "I **I",
      "i **sus4",
      "**5 **6",
      "III **7",
      "iv **9",
      "iv **sus98",
      "**ret **56",
      "IV **sus98",
      "65 **sus76",
      "VI **7",
      "I **9",
      "V65 **sus76",
      "/ **♭",
      "V7 **sus98",
      "V7 **sus23",
      "V7 **sus4",
      "iii **sus43",
      ") **([",
      "I **sus43",
      "V **9",
      "i **7",
      "**5 **4",
      "**2 **1",
      "vi **ø",
      "ii **9",
      "III **sus98",
      "**sus **54",
      "**sus **21",
      "iv **43",
      "VI **ret",
      "VI6 **4",
      "**23 **sus43",
      "VIret **23sus43",
      "I **42",
      "IV **42",
      "**sus **65",
      "VI **42",
      "IV6 **sus76",
      "iii6 **4",
      "I **v",
      "i **42",
      "V6 **sus76",
      "♭) **([",
      "( **♭",
      "7 **sus23",
      "v **7",
      "**I **V",
      "**v **sus76",
      "vi **sus4",
      "vi **sus21",
      "vi **vsus76",
      "ii **sus4",
      "ii **IV",
      "I6 **5",
      "iv **sus76",
      "V65 **0",
      "ii65 **sus76",
      "V43 **sus76",
      "I64 **ret56",
      "iiIV **65",
      "ivsus76 **sus98",
      "7 **sus43",
      "I **sus23",
      "I **sus4",
      "V **sus23",
      "] **)",
      "i **43",
      "s **us",
      "v **sus98",
      "vi **43",
      "ii **sus23",
      "IV **sus43",
      "III **9",
      "III **42",
      "III **sus23",
      "iv **42",
      "V65 **sus23",
      "VI **sus98",
      "VI **sus76",
      "Vsus43 **sus65",
      "ii6 **sus76",
      "I64 **sus54",
      "VI6 **sus76",
      "VI6 **ret56",
      "vii6 **4",
      "ii43 **sus54",
      "II **6",
      "iiisus43 **sus23",
      "viø **7",
      "viø **65",
      "sus **43",
      "IVsus43 **sus98",
      "I **sus21",
      "V **sus65",
      "IV **ret56",
      "iii6 **sus23",
      "Iv **6",
      ") **)",
      "#) **([",
      ") **("
    ]
  }
}