{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<BOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<EOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<MASK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<BOS>": {
        "id": "<BOS>",
        "ids": [
          1
        ],
        "tokens": [
          "<BOS>"
        ]
      },
      "<EOS>": {
        "id": "<EOS>",
        "ids": [
          2
        ],
        "tokens": [
          "<EOS>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<UNK>",
    "continuing_subword_prefix": "**",
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<UNK>": 0,
      "<BOS>": 1,
      "<EOS>": 2,
      "<PAD>": 3,
      "<MASK>": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      ",": 8,
      "A": 9,
      "B": 10,
      "C": 11,
      "D": 12,
      "E": 13,
      "F": 14,
      "G": 15,
      "x": 16,
      "♭": 17,
      "**C": 18,
      "**D": 19,
      "**E": 20,
      "**B": 21,
      "**G": 22,
      "**F": 23,
      "**A": 24,
      "**(": 25,
      "**)": 26,
      "**x": 27,
      "**,": 28,
      "**♭": 29,
      "#)": 30,
      "#,": 31,
      "♭,": 32,
      "♭)": 33,
      "♭(": 34,
      ")(": 35,
      "#(": 36,
      "#)(": 37,
      "♭)(": 38,
      "BD": 39,
      "DF": 40,
      "GB": 41,
      "CE": 42,
      "FA": 43,
      "EG": 44,
      "AC": 45,
      "BF": 46,
      "DA": 47,
      "EB": 48,
      "Fx": 49,
      "AE": 50,
      "FD": 51,
      "))": 52,
      "FB": 53,
      ",(": 54,
      "**EG": 55,
      "**AC": 56,
      "GD": 57,
      "FC": 58,
      "CG": 59,
      "AD": 60,
      "**GB": 61,
      "GE": 62,
      "CA": 63,
      "DB": 64,
      "BB": 65,
      "EA": 66,
      "**CE": 67,
      "**DF": 68,
      "BE": 69,
      "**FA": 70,
      "AF": 71,
      "EC": 72,
      "BG": 73,
      "♭))": 74,
      "♭,(": 75,
      "FF": 76,
      "#,(": 77,
      "CC": 78,
      "Gx": 79,
      "#))": 80,
      "DFB": 81,
      "**DG": 82,
      "Cx": 83,
      "GC": 84,
      "EE": 85,
      "CF": 86,
      "AA": 87,
      "**GC": 88,
      "DG": 89,
      "**CF": 90,
      "DD": 91,
      "GG": 92,
      "DADF": 93,
      "GDGB": 94,
      "EBEG": 95,
      "CGCE": 96,
      "FCFA": 97,
      "FxA": 98,
      "))(": 99,
      "AEAC": 100,
      "AAC": 101,
      "DDF": 102,
      "GGB": 103,
      "GDB": 104,
      "**AF": 105,
      "EEG": 106,
      "DAF": 107,
      "EBG": 108,
      "**EC": 109,
      "AEC": 110,
      "BBD": 111,
      "FACF": 112,
      "CEGC": 113,
      "GBDG": 114,
      "EGC": 115,
      "ACF": 116,
      "**GD": 117,
      "GCE": 118,
      "CFA": 119,
      "BEG": 120,
      "ADF": 121,
      "♭))(": 122,
      "EAC": 123,
      "DGB": 124,
      "EGB": 125,
      "**DB": 126,
      "BDF": 127,
      "♭♭": 128,
      "CCEG": 129,
      "FCA": 130,
      "FFAC": 131,
      "GGBD": 132,
      "CGE": 133,
      "**GE": 134,
      "FAF": 135,
      "GxB": 136,
      "**CA": 137,
      "ACE": 138,
      "FxD": 139,
      "**BG": 140,
      "DFA": 141,
      "CEC": 142,
      "CCE": 143,
      "BDG": 144,
      "FFA": 145,
      "BBF": 146,
      "BC": 147,
      "#))(": 148,
      "GGDB": 149,
      "EF": 150,
      "FDB": 151,
      "CxE": 152,
      "FFCA": 153,
      "EEBG": 154,
      "CCGE": 155,
      "FAFC": 156,
      "AAEC": 157,
      "DDAF": 158,
      "CECG": 159,
      "GBGD": 160,
      "AB": 161,
      "EBE": 162,
      "AEA": 163,
      "DAD": 164,
      "GDBG": 165,
      "((": 166,
      "FCAF": 167,
      "FAC": 168,
      "CGEC": 169,
      "CEG": 170,
      "ADA": 171,
      "GBD": 172,
      "EAE": 173,
      "BEB": 174,
      "BA": 175,
      "AFC": 176,
      "BGD": 177,
      "ECG": 178,
      "GxE": 179,
      "DE": 180,
      "**DA": 181,
      "EGBE": 182,
      "Dx": 183,
      "GA": 184,
      "DFAD": 185,
      "AFCF": 186,
      "CxA": 187,
      "GF": 188,
      "BGDG": 189,
      "ECGC": 190,
      "ACEA": 191,
      "♭((": 192,
      "EGCG": 193,
      "CD": 194,
      "CB": 195,
      "FxC": 196,
      "♭♭)": 197,
      "BDGD": 198,
      "EEA": 199,
      "AAD": 200,
      "ACFC": 201,
      "FG": 202,
      "BBE": 203,
      "FE": 204,
      "FFB": 205,
      "**EB": 206,
      "**AE": 207,
      "BDB": 208,
      "FCF": 209,
      "DBF": 210,
      "DFF": 211,
      "FDA": 212,
      "DC": 213,
      "GDG": 214,
      "CGC": 215,
      "AG": 216,
      ")((": 217,
      "GEB": 218,
      "ED": 219,
      "CAE": 220,
      "DAC": 221,
      "EBD": 222,
      "AEG": 223,
      "GGC": 224,
      "DDG": 225,
      "#((": 226,
      "ADD": 227,
      "EAA": 228,
      "CCF": 229,
      "CFC": 230,
      "GBG": 231,
      "AFCE": 232,
      "BGDF": 233,
      "FBD": 234,
      "DFG": 235,
      "BEE": 236,
      "ECGB": 237,
      "AACF": 238,
      "EEGC": 239,
      "**EA": 240,
      "FDF": 241,
      "BBDG": 242,
      "DDFB": 243,
      "EBB": 244,
      "EGCC": 245,
      "DFD": 246,
      "DAA": 247,
      "ACFF": 248,
      "♭♭(": 249,
      "**BD": 250,
      "#)((": 251,
      "BDDG": 252,
      "DFDA": 253,
      "FAD": 254,
      "EGGC": 255,
      "EGEB": 256,
      "ACAE": 257,
      "AEE": 258,
      "CxG": 259,
      "GCG": 260,
      "♭♭,": 261,
      "BDGG": 262,
      "FACD": 263,
      "CEGA": 264,
      "GBDE": 265,
      "BDBF": 266,
      "DFFB": 267,
      "AGC": 268,
      "ACCF": 269,
      "BBDF": 270,
      "DFBD": 271,
      "DDFA": 272,
      "**BE": 273,
      "GBE": 274,
      "ACA": 275,
      "GEA": 276,
      "DBE": 277,
      "DGD": 278,
      "AACE": 279,
      "EEGB": 280,
      "EGA": 281,
      "ACC": 282,
      "ACD": 283,
      "FDG": 284,
      "FCAC": 285,
      "CAD": 286,
      "DDA": 287,
      "GDBD": 288,
      "BAD": 289,
      "DCF": 290,
      "BDD": 291,
      "BDE": 292,
      "DFAF": 293,
      "CEA": 294,
      "EGE": 295,
      "ACEC": 296,
      "CGEG": 297,
      "ADC": 298,
      "GEC": 299,
      "CAF": 300,
      "EAG": 301,
      "BED": 302,
      "GxD": 303,
      "EEB": 304,
      "EGBG": 305,
      "AFCC": 306,
      "EGG": 307,
      "BGDD": 308,
      "BGB": 309,
      "EDG": 310,
      "♭)((": 311,
      "DDGB": 312,
      "GGCE": 313,
      "FFAF": 314,
      "DBG": 315,
      "BBEG": 316,
      "CCFA": 317,
      "EEAC": 318,
      "AAE": 319,
      "AADF": 320,
      "EGBC": 321,
      "ACEF": 322,
      "DFAB": 323,
      "CCEC": 324,
      "ECGG": 325,
      "EEAB": 326,
      "AADE": 327,
      "GGCD": 328,
      "CCFG": 329,
      "BAF": 330,
      "EDB": 331,
      "**Fx": 332,
      "**,(": 333,
      "FFC": 334,
      "GGBG": 335,
      "BDFG": 336,
      "BBEF": 337,
      "DDGA": 338,
      "Ax": 339,
      "GEG": 340,
      "BFDG": 341,
      "FxEA": 342,
      "GxF": 343,
      "GDBE": 344,
      "DAFD": 345,
      "AECA": 346,
      "EGCB": 347,
      "ACFE": 348,
      "FCAD": 349,
      "CGEA": 350,
      "BDGF": 351,
      "ABF": 352,
      "GFBD": 353,
      "CAC": 354,
      "**AD": 355,
      "FBDG": 356,
      "GDF": 357,
      "CCG": 358,
      "GGD": 359,
      "EBGE": 360,
      "AGE": 361,
      "CDA": 362,
      "DCA": 363,
      "BDGB": 364,
      "EGCE": 365,
      "GCC": 366,
      "CFF": 367,
      "DGG": 368,
      "GGBE": 369,
      "CCEA": 370,
      "FFAD": 371,
      "DEB": 372,
      "GAE": 373,
      "**BF": 374,
      "BDBG": 375,
      "DFDB": 376,
      "GBF": 377,
      "CEB": 378,
      "FAE": 379,
      "EGEC": 380,
      "ACFA": 381,
      "ACAF": 382,
      "FDGB": 383,
      "FCE": 384,
      "CGB": 385,
      "GEAC": 386,
      "CADF": 387,
      "DFBF": 388,
      "CxBE": 389,
      "EEC": 390,
      "AAF": 391,
      "DxFx": 392,
      "CDF": 393,
      "FGB": 394,
      "GAC": 395,
      "FxB": 396,
      "FDD": 397,
      "DBEG": 398,
      "ABD": 399,
      "FDAD": 400,
      "GEBE": 401,
      "CAEA": 402,
      "CFCG": 403,
      "AFA": 404,
      "DEG": 405,
      "ECE": 406,
      "GBDB": 407,
      "CEGE": 408,
      "BFGD": 409,
      "CAA": 410,
      "DBB": 411,
      "BBG": 412,
      "BEC": 413,
      "AFAC": 414,
      "ECEG": 415,
      "FFDA": 416,
      "CCAE": 417,
      "GCB": 418,
      "CFE": 419,
      "DGF": 420,
      "DGDA": 421,
      "DDBF": 422,
      "GGEB": 423,
      "DDFD": 424,
      "EEGE": 425,
      "ADAE": 426,
      "BGBD": 427,
      "FGBD": 428,
      "),(": 429,
      "GBEB": 430,
      "CEAE": 431,
      "FACA": 432,
      "FADA": 433,
      "EBGC": 434,
      "AECF": 435,
      "FDFA": 436,
      "GDD": 437,
      "FCC": 438,
      "FCD": 439,
      "CGG": 440,
      "GEE": 441,
      "DBDF": 442,
      "EAF": 443,
      "AFF": 444,
      "ECA": 445,
      "GCGD": 446,
      "DAFB": 447,
      "DAFF": 448,
      "BBDB": 449,
      "FAFF": 450,
      "CECC": 451,
      "EAEB": 452,
      "BEBF": 453,
      "GFD": 454,
      "♭♭)(": 455,
      "GBGG": 456,
      "GEGB": 457,
      "CACE": 458,
      "FGD": 459,
      "♭),(": 460,
      "BDFA": 461,
      "DACF": 462,
      "EBDG": 463,
      "AEGC": 464,
      "BEBG": 465,
      "AFD": 466,
      "AFE": 467,
      "ECB": 468,
      "BGE": 469,
      "BGF": 470,
      "AACA": 471,
      "EBGG": 472,
      "DxC": 473,
      "DBFD": 474,
      "GDFB": 475,
      "GBEG": 476,
      "CEAC": 477,
      "FADF": 478,
      "EBF": 479,
      "FxE": 480,
      "ADB": 481,
      "ADAF": 482,
      "EAEC": 483,
      "ECC": 484,
      "FFE": 485,
      "CCB": 486,
      "CxB": 487,
      "GCGE": 488,
      "CFD": 489,
      "CFCA": 490,
      "DGDB": 491,
      "GGF": 492,
      "AECC": 493,
      "DxA": 494,
      "♭♭))": 495,
      "DxFxA": 496,
      "BGFD": 497
    },
    "merges": [
      "# **)",
      "# **,",
      "♭ **,",
      "♭ **)",
      "♭ **(",
      ") **(",
      "# **(",
      "#) **(",
      "♭) **(",
      "B **D",
      "D **F",
      "G **B",
      "C **E",
      "F **A",
      "E **G",
      "A **C",
      "B **F",
      "D **A",
      "E **B",
      "F **x",
      "A **E",
      "F **D",
      ") **)",
      "F **B",
      ", **(",
      "**E **G",
      "**A **C",
      "G **D",
      "F **C",
      "C **G",
      "A **D",
      "**G **B",
      "G **E",
      "C **A",
      "D **B",
      "B **B",
      "E **A",
      "**C **E",
      "**D **F",
      "B **E",
      "**F **A",
      "A **F",
      "E **C",
      "B **G",
      "♭) **)",
      "♭, **(",
      "F **F",
      "#, **(",
      "C **C",
      "G **x",
      "#) **)",
      "DF **B",
      "**D **G",
      "C **x",
      "G **C",
      "E **E",
      "C **F",
      "A **A",
      "**G **C",
      "D **G",
      "**C **F",
      "D **D",
      "G **G",
      "DA **DF",
      "GD **GB",
      "EB **EG",
      "CG **CE",
      "FC **FA",
      "Fx **A",
      ")) **(",
      "AE **AC",
      "A **AC",
      "D **DF",
      "G **GB",
      "GD **B",
      "**A **F",
      "E **EG",
      "DA **F",
      "EB **G",
      "**E **C",
      "AE **C",
      "BB **D",
      "FA **CF",
      "CE **GC",
      "GB **DG",
      "EG **C",
      "AC **F",
      "**G **D",
      "G **CE",
      "C **FA",
      "B **EG",
      "AD **F",
      "♭)) **(",
      "E **AC",
      "D **GB",
      "EG **B",
      "**D **B",
      "BD **F",
      "♭ **♭",
      "CC **EG",
      "FC **A",
      "FF **AC",
      "GGB **D",
      "CG **E",
      "**G **E",
      "FA **F",
      "Gx **B",
      "**C **A",
      "AC **E",
      "Fx **D",
      "**B **G",
      "DF **A",
      "CE **C",
      "C **CE",
      "BD **G",
      "F **FA",
      "BB **F",
      "B **C",
      "#)) **(",
      "GG **DB",
      "E **F",
      "FD **B",
      "Cx **E",
      "FF **CA",
      "EE **BG",
      "CC **GE",
      "FAF **C",
      "AA **EC",
      "DD **AF",
      "CEC **G",
      "GB **GD",
      "A **B",
      "EB **E",
      "AE **A",
      "DA **D",
      "GDB **G",
      "( **(",
      "FC **AF",
      "FA **C",
      "CG **EC",
      "CE **G",
      "AD **A",
      "GB **D",
      "EA **E",
      "BE **B",
      "B **A",
      "AF **C",
      "BG **D",
      "EC **G",
      "Gx **E",
      "D **E",
      "**D **A",
      "EGB **E",
      "D **x",
      "G **A",
      "DFA **D",
      "AF **CF",
      "Cx **A",
      "G **F",
      "BG **DG",
      "EC **GC",
      "ACE **A",
      "♭( **(",
      "EGC **G",
      "C **D",
      "C **B",
      "Fx **C",
      "♭♭ **)",
      "BD **GD",
      "EE **A",
      "AA **D",
      "ACF **C",
      "F **G",
      "BB **E",
      "F **E",
      "FF **B",
      "**E **B",
      "**A **E",
      "BD **B",
      "FC **F",
      "DB **F",
      "DF **F",
      "FD **A",
      "D **C",
      "GD **G",
      "CG **C",
      "A **G",
      ")( **(",
      "GE **B",
      "E **D",
      "CA **E",
      "DA **C",
      "EB **D",
      "AE **G",
      "G **GC",
      "D **DG",
      "#( **(",
      "AD **D",
      "EA **A",
      "CC **F",
      "CF **C",
      "GB **G",
      "AF **CE",
      "BG **DF",
      "FB **D",
      "DF **G",
      "BE **E",
      "EC **GB",
      "AAC **F",
      "EEG **C",
      "**E **A",
      "FD **F",
      "BB **DG",
      "DDF **B",
      "EB **B",
      "EGC **C",
      "DF **D",
      "DA **A",
      "ACF **F",
      "♭♭ **(",
      "**B **D",
      "#)( **(",
      "BD **DG",
      "DF **DA",
      "FA **D",
      "EG **GC",
      "EG **EB",
      "AC **AE",
      "AE **E",
      "Cx **G",
      "GC **G",
      "♭♭ **,",
      "BDG **G",
      "FAC **D",
      "CEG **A",
      "GBD **E",
      "BDB **F",
      "DFF **B",
      "A **GC",
      "AC **CF",
      "BB **DF",
      "DFB **D",
      "DDF **A",
      "**B **E",
      "GB **E",
      "AC **A",
      "GE **A",
      "DB **E",
      "DG **D",
      "AAC **E",
      "EEG **B",
      "EG **A",
      "AC **C",
      "AC **D",
      "FD **G",
      "FC **AC",
      "CA **D",
      "DD **A",
      "GDB **D",
      "BA **D",
      "D **CF",
      "BD **D",
      "BD **E",
      "DF **AF",
      "CE **A",
      "EG **E",
      "AC **EC",
      "CG **EG",
      "AD **C",
      "GE **C",
      "CA **F",
      "EA **G",
      "BE **D",
      "Gx **D",
      "EE **B",
      "EGB **G",
      "AFC **C",
      "EG **G",
      "BGD **D",
      "B **GB",
      "E **DG",
      "♭)( **(",
      "DD **GB",
      "GG **CE",
      "FFA **F",
      "DB **G",
      "BB **EG",
      "CC **FA",
      "EE **AC",
      "AA **E",
      "AA **DF",
      "EGB **C",
      "ACE **F",
      "DFA **B",
      "CCE **C",
      "ECG **G",
      "EEA **B",
      "AAD **E",
      "GGC **D",
      "CCF **G",
      "B **AF",
      "E **DB",
      "**F **x",
      "**, **(",
      "FF **C",
      "GGB **G",
      "BDF **G",
      "BBE **F",
      "DDG **A",
      "A **x",
      "G **EG",
      "BF **DG",
      "Fx **EA",
      "Gx **F",
      "GDB **E",
      "DAF **D",
      "AEC **A",
      "EGC **B",
      "ACF **E",
      "FCA **D",
      "CGE **A",
      "BDG **F",
      "AB **F",
      "GF **BD",
      "C **AC",
      "**A **D",
      "FB **DG",
      "GD **F",
      "CC **G",
      "GG **D",
      "EBG **E",
      "A **GE",
      "C **DA",
      "D **CA",
      "BD **GB",
      "EG **CE",
      "GC **C",
      "CF **F",
      "DG **G",
      "GGB **E",
      "CCE **A",
      "FFA **D",
      "DE **B",
      "GA **E",
      "**B **F",
      "BD **BG",
      "DF **DB",
      "GB **F",
      "CE **B",
      "FA **E",
      "EG **EC",
      "AC **FA",
      "AC **AF",
      "FD **GB",
      "FC **E",
      "CG **B",
      "GE **AC",
      "CA **DF",
      "DFB **F",
      "Cx **BE",
      "EE **C",
      "AA **F",
      "Dx **Fx",
      "C **DF",
      "F **GB",
      "G **AC",
      "Fx **B",
      "FD **D",
      "DB **EG",
      "AB **D",
      "FDA **D",
      "GEB **E",
      "CAE **A",
      "CFC **G",
      "A **FA",
      "D **EG",
      "E **CE",
      "GB **DB",
      "CE **GE",
      "BF **GD",
      "CA **A",
      "DB **B",
      "BB **G",
      "BE **C",
      "AF **AC",
      "EC **EG",
      "FF **DA",
      "CC **AE",
      "GC **B",
      "CF **E",
      "DG **F",
      "DG **DA",
      "DD **BF",
      "GG **EB",
      "DDF **D",
      "EEG **E",
      "ADA **E",
      "BGB **D",
      "FGB **D",
      ") **,(",
      "GB **EB",
      "CE **AE",
      "FA **CA",
      "FA **DA",
      "EB **GC",
      "AE **CF",
      "FD **FA",
      "GD **D",
      "FC **C",
      "FC **D",
      "CG **G",
      "GE **E",
      "DB **DF",
      "EA **F",
      "AF **F",
      "EC **A",
      "GC **GD",
      "DAF **B",
      "DAF **F",
      "BBD **B",
      "FAF **F",
      "CEC **C",
      "EAE **B",
      "BEB **F",
      "GF **D",
      "♭♭) **(",
      "GBG **G",
      "GEG **B",
      "CAC **E",
      "F **GD",
      "♭) **,(",
      "BD **FA",
      "DA **CF",
      "EB **DG",
      "AE **GC",
      "BE **BG",
      "AF **D",
      "AF **E",
      "EC **B",
      "BG **E",
      "BG **F",
      "AAC **A",
      "EBG **G",
      "Dx **C",
      "DBF **D",
      "GDF **B",
      "GB **EG",
      "CE **AC",
      "FA **DF",
      "EB **F",
      "Fx **E",
      "AD **B",
      "AD **AF",
      "EA **EC",
      "EC **C",
      "FF **E",
      "CC **B",
      "Cx **B",
      "GC **GE",
      "CF **D",
      "CF **CA",
      "DG **DB",
      "GG **F",
      "AEC **C",
      "Dx **A",
      "♭♭) **)",
      "DxFx **A",
      "BGF **D"
    ]
  }
}